{"weightsManifest": [{"paths": ["group1-shard1of129.bin", "group1-shard2of129.bin", "group1-shard3of129.bin", "group1-shard4of129.bin", "group1-shard5of129.bin", "group1-shard6of129.bin", "group1-shard7of129.bin", "group1-shard8of129.bin", "group1-shard9of129.bin", "group1-shard10of129.bin", "group1-shard11of129.bin", "group1-shard12of129.bin", "group1-shard13of129.bin", "group1-shard14of129.bin", "group1-shard15of129.bin", "group1-shard16of129.bin", "group1-shard17of129.bin", "group1-shard18of129.bin", "group1-shard19of129.bin", "group1-shard20of129.bin", "group1-shard21of129.bin", "group1-shard22of129.bin", "group1-shard23of129.bin", "group1-shard24of129.bin", "group1-shard25of129.bin", "group1-shard26of129.bin", "group1-shard27of129.bin", "group1-shard28of129.bin", "group1-shard29of129.bin", "group1-shard30of129.bin", "group1-shard31of129.bin", "group1-shard32of129.bin", "group1-shard33of129.bin", "group1-shard34of129.bin", "group1-shard35of129.bin", "group1-shard36of129.bin", "group1-shard37of129.bin", "group1-shard38of129.bin", "group1-shard39of129.bin", "group1-shard40of129.bin", "group1-shard41of129.bin", "group1-shard42of129.bin", "group1-shard43of129.bin", "group1-shard44of129.bin", "group1-shard45of129.bin", "group1-shard46of129.bin", "group1-shard47of129.bin", "group1-shard48of129.bin", "group1-shard49of129.bin", "group1-shard50of129.bin", "group1-shard51of129.bin", "group1-shard52of129.bin", "group1-shard53of129.bin", "group1-shard54of129.bin", "group1-shard55of129.bin", "group1-shard56of129.bin", "group1-shard57of129.bin", "group1-shard58of129.bin", "group1-shard59of129.bin", "group1-shard60of129.bin", "group1-shard61of129.bin", "group1-shard62of129.bin", "group1-shard63of129.bin", "group1-shard64of129.bin", "group1-shard65of129.bin", "group1-shard66of129.bin", "group1-shard67of129.bin", "group1-shard68of129.bin", "group1-shard69of129.bin", "group1-shard70of129.bin", "group1-shard71of129.bin", "group1-shard72of129.bin", "group1-shard73of129.bin", "group1-shard74of129.bin", "group1-shard75of129.bin", "group1-shard76of129.bin", "group1-shard77of129.bin", "group1-shard78of129.bin", "group1-shard79of129.bin", "group1-shard80of129.bin", "group1-shard81of129.bin", "group1-shard82of129.bin", "group1-shard83of129.bin", "group1-shard84of129.bin", "group1-shard85of129.bin", "group1-shard86of129.bin", "group1-shard87of129.bin", "group1-shard88of129.bin", "group1-shard89of129.bin", "group1-shard90of129.bin", "group1-shard91of129.bin", "group1-shard92of129.bin", "group1-shard93of129.bin", "group1-shard94of129.bin", "group1-shard95of129.bin", "group1-shard96of129.bin", "group1-shard97of129.bin", "group1-shard98of129.bin", "group1-shard99of129.bin", "group1-shard100of129.bin", "group1-shard101of129.bin", "group1-shard102of129.bin", "group1-shard103of129.bin", "group1-shard104of129.bin", "group1-shard105of129.bin", "group1-shard106of129.bin", "group1-shard107of129.bin", "group1-shard108of129.bin", "group1-shard109of129.bin", "group1-shard110of129.bin", "group1-shard111of129.bin", "group1-shard112of129.bin", "group1-shard113of129.bin", "group1-shard114of129.bin", "group1-shard115of129.bin", "group1-shard116of129.bin", "group1-shard117of129.bin", "group1-shard118of129.bin", "group1-shard119of129.bin", "group1-shard120of129.bin", "group1-shard121of129.bin", "group1-shard122of129.bin", "group1-shard123of129.bin", "group1-shard124of129.bin", "group1-shard125of129.bin", "group1-shard126of129.bin", "group1-shard127of129.bin", "group1-shard128of129.bin", "group1-shard129of129.bin"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 64], "name": "block1_conv1/kernel"}, {"dtype": "float32", "shape": [64], "name": "block1_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "block1_conv2/kernel"}, {"dtype": "float32", "shape": [64], "name": "block1_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "block2_conv1/kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "block2_conv2/kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 256], "name": "block3_conv1/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv2/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv3/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv3/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 512], "name": "block4_conv1/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv2/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv3/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv3/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv1/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv2/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv3/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv3/bias"}, {"dtype": "float32", "shape": [25088, 4096], "name": "fc1/kernel"}, {"dtype": "float32", "shape": [4096], "name": "fc1/bias"}, {"dtype": "float32", "shape": [4096, 4096], "name": "fc2/kernel"}, {"dtype": "float32", "shape": [4096], "name": "fc2/bias"}]}], "modelTopology": {"keras_version": "2.3.1", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"name": "block1_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block1_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block2_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block2_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"name": "block2_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block2_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"name": "block3_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block3_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"name": "block4_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block4_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"name": "block5_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block5_pool"}, {"class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}, "name": "flatten"}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4096, "use_bias": true, "activity_regularizer": null}, "name": "fc1"}, {"class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4096, "use_bias": true, "activity_regularizer": null}, "name": "fc2"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["fc2", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.5.2", "format": "layers-model"}